
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>拉流直播 · gitbook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lemon">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="示例11.html" />
    
    
    <link rel="prev" href="示例9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    声明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="示例1.html">
            
                <a href="示例1.html">
            
                    
                    快速开始
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="示例3.html">
            
                <a href="示例3.html">
            
                    
                    注册登录
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="示例18.html">
            
                <a href="示例18.html">
            
                    
                    注册
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.2" data-path="示例2.html">
            
                <a href="示例2.html">
            
                    
                    登录
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="示例4.html">
            
                <a href="示例4.html">
            
                    
                    频道维护
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="示例5.html">
            
                <a href="示例5.html">
            
                    
                    分类标签
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="示例6.html">
            
                <a href="示例6.html">
            
                    
                    快速直播流程
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="示例7.html">
            
                <a href="示例7.html">
            
                    
                    直播方式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="示例8.html">
            
                <a href="示例8.html">
            
                    
                    标准直播
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="示例9.html">
            
                <a href="示例9.html">
            
                    
                    专业设备直播
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.2" data-path="示例10.html">
            
                <a href="示例10.html">
            
                    
                    拉流直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="示例11.html">
            
                <a href="示例11.html">
            
                    
                    列表直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="示例12.html">
            
                <a href="示例12.html">
            
                    
                    桌面直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="示例13.html">
            
                <a href="示例13.html">
            
                    
                    手机直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="示例14.html">
            
                <a href="示例14.html">
            
                    
                    网页直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="示例15.html">
            
                <a href="示例15.html">
            
                    
                    导播台直播
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="示例16.html">
            
                <a href="示例16.html">
            
                    
                    连麦直播
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="示例17.html">
            
                <a href="示例17.html">
            
                    
                    连麦直播-旧版
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >拉流直播</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x591A;&#x6E20;&#x9053;&#x6388;&#x6743;
&#x76EE;&#x524D;&#x6388;&#x6743;&#x89C2;&#x770B;&#x652F;&#x6301;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x6E20;&#x9053;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#x3002;&#x81EA;&#x5EFA;&#x6E20;&#x9053;&#x7684;&#x6388;&#x6743;&#x9ED8;&#x8BA4;&#x8DDF;&#x968F;&#x4E3B;&#x6E20;&#x9053;&#x53D8;&#x5316;&#xFF0C;&#x82E5;&#x67D0;&#x4E2A;&#x6E20;&#x9053;&#x6709;&#x7279;&#x6B8A;&#x6388;&#x6743;&#x9700;&#x6C42;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x8BE5;&#x6E20;&#x9053;&#x8FDB;&#x884C;&#x6388;&#x6743;&#x8BBE;&#x7F6E;&#x3002;
&#x6E20;&#x9053;
&#x53EF;&#x5728;&#x6388;&#x6743;&#x89C2;&#x770B;&#x8BBE;&#x7F6E;&#x5185;&#x65B0;&#x589E;&#x6E20;&#x9053;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B0;&#x589E;&#x7684;&#x6E20;&#x9053;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x6388;&#x6743;&#x65B9;&#x5F0F;&#x3001;&#x89C2;&#x770B;&#x9875;&#x94FE;&#x63A5;&#x3001;&#x7D2F;&#x8BA1;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7EDF;&#x8BA1;
&#x53EF;&#x5BF9;&#x6E20;&#x9053;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x8FDB;&#x884C;&#x505C;&#x7528;&#xFF0C;&#x505C;&#x7528;&#x540E;&#xFF0C;&#x8BE5;&#x6E20;&#x9053;&#x7684;&#x89C2;&#x770B;&#x5730;&#x5740;&#x5C06;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x3002;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426703818-88309441-ab25-4677-85c8-507fa8424568.png#" alt="">
&#x6388;&#x6743;&#x89C2;&#x770B;
&#x6388;&#x6743;&#x89C2;&#x770B;&#x7C7B;&#x578B;&#x5206;&#x4E3A;&#x65E0;&#x9650;&#x5236;&#x3001;&#x9A8C;&#x8BC1;&#x7801;&#x89C2;&#x770B;&#x3001;&#x4ED8;&#x8D39;&#x89C2;&#x770B;&#x3001;&#x624B;&#x673A;&#x767B;&#x8BB0;&#x89C2;&#x770B;&#x3001;&#x89C2;&#x4F17;&#x767D;&#x540D;&#x5355;&#x89C2;&#x770B;&#x3001;&#x81EA;&#x5B9A;&#x4E49;&#x6388;&#x6743;&#x516D;&#x79CD;&#x3002;
&#x65B0;&#x5EFA;&#x9891;&#x9053;&#x9ED8;&#x8BA4;&#x6388;&#x6743;&#x7C7B;&#x578B;&#x4E3A;&#x65E0;&#x9650;&#x5236;&#x3002;&#x5373;&#x7528;&#x6237;&#x65E0;&#x9700;&#x586B;&#x5199;&#x9A8C;&#x8BC1;&#x7801;&#x3001;&#x624B;&#x673A;&#x53F7;&#x548C;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#xFF0C;&#x5C31;&#x80FD;&#x89C2;&#x770B;&#x76F4;&#x64AD;&#x3002;
<strong>&#x9A8C;&#x8BC1;&#x7801;&#x89C2;&#x770B;</strong>
&#x5F53;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x521B;&#x5EFA;&#x7684;<a href="http://mudu.tv/" target="_blank">&#x76F4;&#x64AD;</a>&#x9891;&#x9053;&#x88AB;&#x6240;&#x6709;&#x4EBA;&#x89C2;&#x770B;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x8BE5;&#x9891;&#x9053;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x8FDB;&#x5165;&#x9891;&#x9053;&#x90FD;&#x9700;&#x8981;&#x8F93;&#x5165;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x53EA;&#x6709;&#x8F93;&#x5165;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x548C;&#x4F60;&#x8BBE;&#x7F6E;&#x7684;&#x76F8;&#x540C;&#x65F6;&#x624D;&#x80FD;&#x8FDB;&#x5165;&#x9891;&#x9053;&#x8FDB;&#x884C;&#x76F4;&#x64AD;&#x548C;&#x70B9;&#x64AD;&#x89C2;&#x770B;&#x3002;
&#x8BBE;&#x7F6E;&#x65B9;&#x6CD5;&#x4E3A;&#xFF1A;</p>
<ol>
<li>&#x5C06;&#x6388;&#x6743;&#x89C2;&#x770B;&#x7C7B;&#x578B;&#x8BBE;&#x7F6E;&#x4E3A;&#x9A8C;&#x8BC1;&#x7801;&#x89C2;&#x770B;&#xFF1B;</li>
<li>&#x5728;&#x4E0B;&#x65B9;&#x8F93;&#x5165;&#x6846;&#x8F93;&#x5165;&#x63D0;&#x793A;&#x6587;&#x5B57;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x9A8C;&#x8BC1;&#x7801;&#xFF1B;</li>
<li>&#x70B9;&#x51FB;&#x201C;&#x63D0;&#x4EA4;&#x201D;&#x6309;&#x94AE;&#xFF0C;&#x663E;&#x793A;&#x201C;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#x201D;&#x5373;&#x53EF;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</li>
</ol>
<p><img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426704512-a9051412-d91c-4659-b1ef-bfa0b5ae45c5.png#" alt="">&#x89C2;&#x770B;&#x9875;&#x9762;&#x6548;&#x679C;&#xFF1A;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426705347-c0bf56f8-8cda-4363-9f3e-1f1196092d61.png#" alt=""> 
<strong>&#x4ED8;&#x8D39;&#x89C2;&#x770B;</strong>
&#x5F53;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x521B;&#x5EFA;&#x7684;&#x76F4;&#x64AD;&#x9891;&#x9053;&#x88AB;&#x4EBA;&#x65E0;&#x507F;&#x89C2;&#x770B;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x8BE5;&#x9891;&#x9053;&#x8BBE;&#x7F6E;&#x4ED8;&#x8D39;&#x89C2;&#x770B;&#xFF0C;&#x53EA;&#x6709;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x89C2;&#x770B;&#x8BE5;&#x9891;&#x9053;&#x7684;&#x76F4;&#x64AD;&#x548C;&#x70B9;&#x64AD;&#x5185;&#x5BB9;&#xFF08;&#x6700;&#x591A;&#x53EF;&#x89C2;&#x770B;10&#x5206;&#x949F;&#xFF09;&#x3002;
&#x5C0F;&#x63D0;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x66F4;&#x6539;&#x4E86;&#x76F8;&#x5E94;&#x89C4;&#x5219;&#xFF0C;&#x5219;&#x4E4B;&#x524D;&#x7684;&#x4ED8;&#x8D39;&#x7528;&#x6237;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x4ED8;&#x8D39;&#xFF0C;&#x5EFA;&#x8BAE;&#x8C28;&#x614E;&#x64CD;&#x4F5C;&#x3002;
&#x8BBE;&#x7F6E;&#x65B9;&#x6CD5;&#x4E3A;&#xFF1A;</p>
<ol>
<li>&#x5C06;&#x6388;&#x6743;&#x89C2;&#x770B;&#x7C7B;&#x578B;&#x8BBE;&#x7F6E;&#x4ED8;&#x8D39;&#x89C2;&#x770B;&#xFF1B;</li>
<li>&#x5728;&#x4E0B;&#x65B9;&#x8F93;&#x5165;&#x6846;&#x8F93;&#x5165;&#x63D0;&#x793A;&#x6587;&#x5B57;&#x3001;&#x89C2;&#x770B;&#x4EF7;&#x683C;&#x548C;&#x89C2;&#x770B;&#x6709;&#x6548;&#x65F6;&#x95F4;&#xFF1B;</li>
<li>&#x70B9;&#x51FB;&#x201C;&#x63D0;&#x4EA4;&#x201D;&#x6309;&#x94AE;&#xFF0C;&#x663E;&#x793A;&#x201C;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#x201D;&#x5373;&#x53EF;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</li>
</ol>
<p><img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426705931-6437c2fd-bb8d-4490-808d-bdf918d1af8d.png#" alt="">
&#x89C2;&#x770B;&#x9875;&#x9762;&#x6548;&#x679C;&#xFF1A;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426706512-40c52c42-19f9-42e9-afcc-479d53c7d779.png#" alt="">
<strong>&#x624B;&#x673A;&#x53F7;&#x767B;&#x8BB0;&#x89C2;&#x770B;</strong>
&#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x89C2;&#x770B;&#x76F4;&#x64AD;&#x7528;&#x6237;&#x7684;&#x8054;&#x7CFB;&#x65B9;&#x5F0F;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6388;&#x6743;&#x7C7B;&#x578B;&#x4E3A;&#x624B;&#x673A;&#x53F7;&#x767B;&#x8BB0;&#x89C2;&#x770B;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x6709;&#x8F93;&#x5165;&#x624B;&#x673A;&#x53F7;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#x3002;
&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x9ED8;&#x8BA4;&#x662F;&#x5173;&#x95ED;&#x72B6;&#x6001;&#xFF0C;&#x5F53;&#x4F60;&#x5F00;&#x542F;&#x624B;&#x673A;&#x53F7;&#x9A8C;&#x8BC1;&#x4E4B;&#x540E;&#xFF0C;&#x6BCF;&#x4F4D;&#x7528;&#x6237;&#x9996;&#x6B21;&#x767B;&#x5F55;&#x5747;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#xFF0C;&#x901A;&#x8FC7;&#x540E;&#x624D;&#x80FD;&#x767B;&#x5F55;&#x89C2;&#x770B;&#x9875;&#x9762;&#x3002;&#x6BCF;&#x53D1;&#x9001;&#x4E00;&#x6761;&#x77ED;&#x4FE1;&#xFF0C;&#x5C06;&#x5728;&#x4F60;&#x7684;&#x8D26;&#x6237;&#x6263;&#x9664;0.1&#x5143;&#x7684;&#x77ED;&#x4FE1;&#x670D;&#x52A1;&#x8D39;&#xFF0C;&#x8D39;&#x7528;&#x4E0D;&#x8DB3;&#x5C06;&#x81EA;&#x52A8;&#x5173;&#x95ED;&#x6B64;&#x529F;&#x80FD;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x624B;&#x673A;&#x8BB0;&#x5F55;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x201C;&#x67E5;&#x770B;&#x624B;&#x673A;&#x53F7;&#x767B;&#x8BB0;&#x8BB0;&#x5F55;&#x201D;&#x4E2D;&#x67E5;&#x770B;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x67E5;&#x8BE2;&#x7528;&#x6237;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x7684;&#x6263;&#x8D39;&#x606F;&#x3002;
&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x9650;&#x5236;&#x7279;&#x5B9A;&#x4EBA;&#x7FA4;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#xFF0C;&#x5F00;&#x542F;&#x6B64;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x89C2;&#x770B;&#x65F6;&#x5FC5;&#x987B;&#x8F93;&#x5165;&#x767D;&#x540D;&#x5355;&#x5185;&#x7684;&#x624B;&#x673A;&#x53F7;&#xFF0C;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#x3002;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x5148;&#x4E0B;&#x8F7D;Excel&#x6A21;&#x7248;&#xFF0C;&#x586B;&#x597D;&#x767D;&#x540D;&#x5355;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x518D;&#x5BFC;&#x5165;&#x624B;&#x673A;&#x53F7;&#xFF0C;&#x5BFC;&#x5165;&#x5B8C;&#x6210;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;&#x3002;<br><img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426707051-c14e7ad1-7ecf-4e93-b8ac-26a3b149501e.png#" alt="">
&#x89C2;&#x770B;&#x9875;&#x9762;&#x6548;&#x679C;&#xFF1A;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426708013-1f3ce684-3b23-47f3-ab6c-f6aa711278d6.png#" alt="">
&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x7F6E;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x6548;&#x679C;&#xFF1A;</p>
<ol>
<li><strong>&#x4E0D;&#x5F00;&#x542F;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E5F;&#x4E0D;&#x5F00;&#x542F;&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;</strong>&#xFF1A;&#x7528;&#x6237;&#x89C2;&#x770B;&#x76F4;&#x64AD;&#x4EC5;&#x9700;&#x8981;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x624B;&#x673A;&#x53F7;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x89C2;&#x770B;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x7A7A;&#x53F7;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;</li>
<li><strong>&#x5F00;&#x542F;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E0D;&#x5F00;&#x542F;&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;&#xFF1A;</strong>&#x7528;&#x6237;&#x9700;&#x8981;&#x5148;&#x8F93;&#x5165;&#x624B;&#x673A;&#x53F7;&#x548C;&#x56FE;&#x5F62;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x70B9;&#x51FB;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x518D;&#x586B;&#x5199;&#x624B;&#x673A;&#x6536;&#x5230;&#x7684;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x7801;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#x3002;</li>
<li><strong>&#x4E0D;&#x5F00;&#x542F;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#xFF0C;&#x5F00;&#x542F;&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;&#xFF1A;</strong>&#x7528;&#x6237;&#x9700;&#x8981;&#x8F93;&#x5165;&#x767D;&#x540D;&#x5355;&#x5185;&#x7684;&#x624B;&#x673A;&#x53F7;&#x7801;&#xFF0C;&#x624D;&#x80FD;&#x89C2;&#x770B;&#x76F4;&#x64AD;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x8F93;&#x5165;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x7801;&#x3002;</li>
<li><strong>&#x540C;&#x65F6;&#x5F00;&#x542F;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x548C;&#x624B;&#x673A;&#x767D;&#x540D;&#x5355;&#xFF1A;</strong>&#x7528;&#x6237;&#x9996;&#x5148;&#x9700;&#x8981;&#x8F93;&#x5165;&#x624B;&#x673A;&#x53F7;&#x548C;&#x56FE;&#x5F62;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x4E14;&#x624B;&#x673A;&#x53F7;&#x5FC5;&#x987B;&#x662F;&#x767D;&#x540D;&#x5355;&#x4E2D;&#x7684;&#x53F7;&#x7801;&#xFF0C;&#x5426;&#x5219;&#x65E0;&#x6CD5;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x6B65;&#xFF1B;&#x82E5;&#x6210;&#x529F;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;&#x624B;&#x673A;&#x6536;&#x5230;&#x7684;&#x77ED;&#x4FE1;&#x9A8C;&#x8BC1;&#x7801;&#x586B;&#x5165;&#x5F39;&#x6846;&#x4E2D;&#xFF0C;&#x9A8C;&#x8BC1;&#x5B8C;&#x6210;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#x3002;</li>
</ol>
<p>&#x89C2;&#x4F17;&#x767D;&#x540D;&#x5355;&#x89C2;&#x770B;
&#x89C2;&#x4F17;&#x767D;&#x540D;&#x5355;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x9650;&#x5236;&#x7279;&#x5B9A;&#x4EBA;&#x7FA4;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#xFF0C;&#x5F00;&#x542F;&#x6B64;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x7528;&#x6237;&#x89C2;&#x770B;&#x65F6;&#x5FC5;&#x987B;&#x8F93;&#x5165;&#x767D;&#x540D;&#x5355;&#x5185;&#x7684;&#x89C2;&#x4F17;&#x540D;&#x548C;&#x5BC6;&#x7801;&#xFF0C;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x89C2;&#x770B;&#x3002;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426708620-fdb54238-531a-4dbb-b957-6a9a58006678.png#" alt="">
&#x89C2;&#x770B;&#x9875;&#x9762;&#x6548;&#x679C;
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426709240-3b209e7f-6be6-4b87-bfd7-e313c58c1f62.png#" alt="">
<strong>&#x81EA;&#x5B9A;&#x4E49;&#x6388;&#x6743;&#x89C2;&#x770B;&#xFF08;&#x9700;&#x8981;&#x6709;&#x5F00;&#x53D1;&#x80FD;&#x529B;&#xFF09;</strong>
 &#x5F53;&#x4F60;&#x5E0C;&#x671B;&#x6240;&#x6709;&#x89C2;&#x770B;&#x76F4;&#x64AD;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x7279;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x5165;&#x76F4;&#x64AD;&#x89C2;&#x770B;&#x9875;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x81EA;&#x5B9A;&#x4E49;&#x6388;&#x6743;&#xFF0C;&#x5982;&#x4F60;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x5173;&#x6CE8;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x540E;&#x624D;&#x80FD;&#x89C2;&#x770B;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x81EA;&#x5B9A;&#x4E49;&#x6388;&#x6743;&#x89C2;&#x770B;&#xFF08;&#x53EA;&#x6709;&#x4E13;&#x4E1A;&#x7248;&#x7528;&#x6237;&#x548C;&#x4F01;&#x4E1A;&#x7248;&#x7528;&#x6237;&#x624D;&#x53EF;&#x4F7F;&#x7528;&#x6B64;&#x529F;&#x80FD;&#xFF09;&#x3002;
<a href="http://mudu.tv/docs/10130" target="_blank">&#x67E5;&#x770B;&#x8BE6;&#x7EC6;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x548C;&#x5E2E;&#x52A9;&gt;&gt;</a>
<img src="https://cdn.nlark.com/yuque/0/2022/png/974254/1647426710332-c63f63f1-29da-420d-a617-f6e99efcbe67.png#" alt=""></p>

<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="示例9.html" class="navigation navigation-prev " aria-label="Previous page: 专业设备直播">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="示例11.html" class="navigation navigation-next " aria-label="Next page: 列表直播">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"拉流直播","level":"1.3.1.2","depth":3,"next":{"title":"列表直播","level":"1.3.1.3","depth":3,"path":"快速开始/示例11.md","ref":"快速开始/示例11.md","articles":[]},"previous":{"title":"专业设备直播","level":"1.3.1.1","depth":3,"path":"快速开始/示例9.md","ref":"快速开始/示例9.md","articles":[]},"dir":"ltr"},"config":{"plugins":["hide-element","back-to-top-button","-chapter-fold","code","splitter","-lunr","-search","search-pro","popup","anchor-navigation-ex","expandable-chapters-small"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"splitter":{},"search-pro":{},"popup":{},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"associatedWithSummary":true,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"mode":"float","multipleH1":true,"pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"printLog":false,"showGoTop":true,"showLevel":true},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lemon","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"gitbook","language":"zh-hans","gitbook":"*","description":"gitbook"},"file":{"path":"快速开始/示例10.md","mtime":"2022-03-17T08:26:03.037Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-03-17T09:19:11.249Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

